// Задача Nº17. Напишите программу, которая принимает на вход координаты точки (Х и Y). 
// причем Х ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

// int[] coords = new int[2];

// System.Console.WriteLine("Введите координату Х: ");
// coords[0] = Convert.ToInt32(Console.ReadLine());

// System.Console.WriteLine("Введите координату Y: ");
// coords[1] = Convert.ToInt32(Console.ReadLine());

// string[] msg = {
//     "Точка находится в первой четверти"
//     "Точка находится во второй четверти" 
//     "Точка находится в третьей четверти" 
//     "Точка находится в четвертой четверти" 
//     "Одна из координат равна нулю"
//     };

// if (coords[0] > 0 && coords[1] > 0)

//     System.Console.WriteLine(msg[0]);

// else if (coords[0] < 0 && coords[1] > 0)

//     System.Console.WriteLine(msg[1]);

// else if (coords[0] < 0 && coords[1] < 0)

//     System.Console.WriteLine(msg[2]);

// else if (coords[0] > 0 && coords[1] < 0)

//     System.Console.WriteLine(msg[3]);

// else

//     System.Console.WriteLine(msg[4]);


